[
    {
      "name": "Push Up",
      "image": "https://cdn.dribbble.com/users/4927539/screenshots/12723464/pushup-gradient-new.gif",
      "secondary_image": "https://cdn.dribbble.com/users/4927539/screenshots/12723464/pushup-gradient-new.gif",
      "description": "(Also called a press-up in British English) is a common calisthenics exercise beginning from the prone position. By raising and lowering the body using the arms, push-ups exercise the pectoral muscles, triceps, and anterior deltoids, with ancillary benefits to the rest of the deltoids, serratus anterior, coracobrachialis and the midsection as a whole. Push-ups are a basic exercise used in civilian athletic training or physical education and commonly in military physical training. They are also a common form of punishment used in the military, school sport, and some martial arts disciplines",
      "difficulty": "intermediate",
      "equipment": "no equipment",
      "primary":"chest",
      "secondary": "triceps"

    },
  {
    "name": "Dumbbell Biceps Curl",
    "image": "https://i.pinimg.com/originals/7d/3c/de/7d3cdeed84c1c19ad372d5b25beffd08.gif",
    "secondary_image": "https://i.pinimg.com/originals/7d/3c/de/7d3cdeed84c1c19ad372d5b25beffd08.gif",
    "description": "The biceps curl mainly targets the biceps brachii, brachialis and brachioradialis muscles. The biceps is stronger at elbow flexion when the forearm is supinated (palms turned upward) and weaker when the forearm is pronated.[1] The brachioradialis is at its most effective when the palms are facing inward, and the brachialis is unaffected by forearm rotation. Therefore, the degree of forearm rotation affects the degree of muscle recruitment between the three muscles.",
    "difficulty": "intermediate",
    "equipment": "dumbbells",
    "primary":"hamstring",
    "secondary": "none"

  },
  {
    "name": "Deadlift",
    "image": "https://www.inspireusafoundation.org/wp-content/uploads/2022/03/sumo-deadlift.gif",
    "secondary_image": "https://www.inspireusafoundation.org/wp-content/uploads/2022/03/sumo-deadlift.gif",
    "description": "The deadlift is a weight training exercise in which a loaded barbell or bar is lifted off the ground to the level of the hips, torso perpendicular to the floor, before being placed back on the ground. It is one of the three powerlifting exercises, along with the squat and bench press. Deadlift has been shown to improve vertical jump performance and rate of muscle production. It can also be viewed as an ideal exercise for knee rehabilitation.",
    "difficulty": "expert",
    "equipment": "barbell",
    "primary": "glutes",
    "secondary": "hamstring, lowerback"

  },
  {
    "name": "Crunch",
    "image": "https://www.inspireusafoundation.org/wp-content/uploads/2022/12/knee-touch-crunch.gif",
    "secondary_image": "https://www.inspireusafoundation.org/wp-content/uploads/2022/12/knee-touch-crunch.gif",
    "description": "The crunch is one of the most popular abdominal exercises. When performed properly, it engages all the abdominal muscles but primarily it works the rectus abdominis muscle and the obliques. It allows both building six-pack abs, and tightening the belly. Crunches use the exerciser's own body weight to tone muscle, and are recommended as a low-cost exercise that can be performed at home.",
    "difficulty": "beginner",
    "equipment": "no equipment",
    "primary":"abs",
    "secondary": "none"

  }
]